var replacements = {
        "хуймен": "замен",
        "только": "только",
        "когда": "когда",
        "стакан": "майдан",
        "Кличко": "стакан",
        "иди на хуй": "спасибо",
        "какой": "какой",
        "Украин": "Украин",
        "ух ты! я пидораск": "украин",
        "aquila chrysaetos": "беркут",
        "Укpаин": "Укpаин",
        "автохуймен": "автохуймен",
        "тогда": "тогда",
        "сейчас": "сейчас",
        "народ": "народ",
        "поллюцио": "революци",
        "кажется": "кажется",
        "похуй": "похуй",
        "котор": "котор",
        "инбокс": "инбокс",
        "говори": "говори",
        "Президент Украины": "Президент Грузии",
        "титушки": "титушки",
        "Йован": "Президент",
        "сказа": "сказа",
        "и порвал хуем": "теперь",
        "а Укрaїні!": "а Україні!",
        "undefined": "undefined",
        "стебель": "undefined",
        "мудаки": "дневничок",
        "fishki.net": "leprosorium.ru",
        "иди нахуй": "иди нахуй",
        "всегда плюсую": "всегда плюсую",
        "привет лепра": "привет лепра",
        "площадь": "площадь",
        "гопак": "протест",
        "штурм": "штурм",
        "Жириновск": "Грушевск",
        "blink": "irony",
        "регионы": "регионы",
        "пиздеть": "пиздеть",
        "лв": "биткоины",
        "преторианцы": "беркут",
        "а Укрaїні": "а Укрaїні",
        "спасибо": "спасибо",
        "майдан": "майдан"
};

function replaceAll(str, mapObj){
    var re = new RegExp(Object.keys(mapObj).join("|"),"g");

    return str.replace(re, function(matched){
        return mapObj[matched];
    });
}

document.body.innerHTML = replaceAll(document.body.innerHTML, replacements);
